Repository: turanbagtur/chapter-uploader
Catalog: languages/*.po
Languages: tr_tr

source: Meta Box plugin is not installed. %s will use standard WordPress meta fields instead.
tr_tr: Meta Box eklentisi yüklü değil. %s bunun yerine standart WordPress meta alanlarını kullanacak.

source: The "manga" post type is not registered. Please ensure your theme supports manga functionality.
tr_tr: "manga" gönderi türü kayıtlı değil. Lütfen temanızın manga işlevselliğini desteklediğinden emin olun.

source: Manga Chapter Uploader
tr_tr: Manga Bölüm Yükleyici

source: Chapter Uploader
tr_tr: Bölüm Yükleyici

source: Statistics
tr_tr: İstatistikler

source: Settings
tr_tr: Ayarlar

source: Uploading...
tr_tr: Yükleniyor...

source: Processing...
tr_tr: İşleniyor...

source: Complete!
tr_tr: Tamamlandı!

source: Error occurred
tr_tr: Hata oluştu

source: Are you sure you want to cleanup orphaned media? This action cannot be undone.
tr_tr: Sahipsiz medya dosyalarını temizlemek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Author: %s
tr_tr: Yazar: %s

source: MangaReader theme compatible single and multiple manga chapter upload plugin with advanced features.
tr_tr: Gelişmiş özelliklerle MangaReader teması uyumlu tekli ve çoklu manga bölüm yükleme eklentisi.

source: Recent Uploads
tr_tr: Son Yüklemeler

source: ago
tr_tr: önce

source: Single Chapter Upload
tr_tr: Tekli Bölüm Yükleme

source: Multiple Chapters (ZIP)
tr_tr: Çoklu Bölüm (ZIP)

source: Fetch from Blogger
tr_tr: Blogger'dan Çek

source: Chapter Number
tr_tr: Bölüm Numarası

source: Use decimal numbers for special chapters (e.g., 12.5)
tr_tr: Özel bölümler için ondalık sayılar kullanın (örn. 12.5)

source: Chapter Title
tr_tr: Bölüm Başlığı

source: Optional chapter title
tr_tr: Opsiyonel bölüm başlığı

source: Manga Series
tr_tr: Manga Serisi

source: -- Select Manga --
tr_tr: -- Manga Seçin --

source: Current chapters:
tr_tr: Mevcut bölümler:

source: Chapter Prefix
tr_tr: Bölüm Ön Eki

source: Choose prefix for chapter title format
tr_tr: Bölüm başlığı formatı için ön ek seçin

source: Default Chapter Prefix
tr_tr: Varsayılan Bölüm Ön Eki

source: Default prefix for chapter titles
tr_tr: Bölüm başlıkları için varsayılan ön ek

source: Chapter Category
tr_tr: Bölüm Kategorisi

source: -- Select Category (Optional) --
tr_tr: -- Kategori Seçin (Opsiyonel) --

source: Chapter Images
tr_tr: Bölüm Resimleri

source: Drag images here or click to select
tr_tr: Resimleri buraya sürükleyin veya seçmek için tıklayın

source: Max file size: %s | Allowed types: %s
tr_tr: Maksimum dosya boyutu: %s | İzin verilen türler: %s

source: Preview:
tr_tr: Önizleme:

source: Download Link
tr_tr: İndirme Bağlantısı

source: https://example.com/chapter-download
tr_tr: https://ornek.com/bolum-indirme

source: Optional external download link for this chapter
tr_tr: Bu bölüm için opsiyonel harici indirme bağlantısı

source: Photon CDN Status
tr_tr: Photon CDN Durumu

source: Default
tr_tr: Varsayılan

source: Enable
tr_tr: Etkin

source: Disable
tr_tr: Devre Dışı

source: Control Photon CDN usage for chapter images
tr_tr: Bölüm resimleri için Photon CDN kullanımını kontrol et

source: Upload Chapter
tr_tr: Bölümü Yükle

source: Multiple Chapters Upload (ZIP)
tr_tr: Çoklu Bölüm Yükleme (ZIP)

source: ZIP Structure Requirements:
tr_tr: ZIP Yapısı Gereksinimleri:

source: Each folder name should start with chapter number (e.g., "1", "2.5", "10-Title")
tr_tr: Her klasör adı bölüm numarası ile başlamalıdır (örn. "1", "2.5", "10-Başlık")

source: Images should be in JPG, PNG, GIF, or WebP format
tr_tr: Resimler JPG, PNG, GIF veya WebP formatında olmalıdır

source: Images will be sorted alphabetically within each chapter
tr_tr: Resimler her bölüm içinde alfabetik olarak sıralanacaktır

source: ZIP File
tr_tr: ZIP Dosyası

source: Maximum ZIP size: %s
tr_tr: Maksimum ZIP boyutu: %s

source: Chapter Category (Optional)
tr_tr: Bölüm Kategorisi (Opsiyonel)

source: -- Select Category --
tr_tr: -- Kategori Seçin --

source: Upload ZIP and Process
tr_tr: ZIP Yükle ve İşle

source: Fetch Chapter from Blogger
tr_tr: Blogger'dan Bölüm Çek

source: Supported Sites:
tr_tr: Desteklenen Siteler:

source: Blogger.com websites
tr_tr: Blogger.com web siteleri

source: Sites with standard image layouts
tr_tr: Standart resim düzenine sahip siteler

source: Lazy-loading and modern image formats supported
tr_tr: Lazy-loading ve modern resim formatları destekleniyor

source: Blogger URL
tr_tr: Blogger URL'si

source: https://example.blogspot.com/chapter-1
tr_tr: https://ornek.blogspot.com/bolum-1

source: Test URL
tr_tr: URL'yi Test Et

source: Chapter Number (Auto-detect)
tr_tr: Bölüm Numarası (Otomatik Algıla)

source: Will be auto-detected from URL
tr_tr: URL'den otomatik olarak algılanacak

source: Leave empty for auto-detection or enter manually
tr_tr: Otomatik algılama için boş bırakın veya manuel girin

source: Upload Status:
tr_tr: Yükleme Durumu:

source: Debug Information:
tr_tr: Debug Bilgisi:

source: Upload Statistics
tr_tr: Yükleme İstatistikleri

source: Total Chapters
tr_tr: Toplam Bölümler

source: Total Images
tr_tr: Toplam Resimler

source: Total Size
tr_tr: Toplam Boyut

source: This Month
tr_tr: Bu Ay

source: Cleanup Orphaned Media
tr_tr: Sahipsiz Medyaları Temizle

source: Refresh Statistics
tr_tr: İstatistikleri Yenile

source: Settings saved successfully!
tr_tr: Ayarlar başarıyla kaydedildi!

source: Language
tr_tr: Dil

source: Select the plugin interface language
tr_tr: Eklenti arayüz dilini seçin

source: Maximum Upload Size
tr_tr: Maksimum Yükleme Boyutu

source: Maximum file size for individual images
tr_tr: Tekil resimler için maksimum dosya boyutu

source: Auto Cleanup
tr_tr: Otomatik Temizlik

source: Automatically cleanup orphaned media files daily
tr_tr: Sahipsiz medya dosyalarını her gün otomatik olarak temizle

source: Statistics Tracking
tr_tr: İstatistik Takibi

source: Enable upload statistics tracking
tr_tr: Yükleme istatistik takibini etkinleştir

source: Image Quality
tr_tr: Resim Kalitesi

source: Original (100%)
tr_tr: Orijinal (100%)

source: High Quality (95%)
tr_tr: Yüksek Kalite (95%)

source: Good Quality (90%)
tr_tr: İyi Kalite (90%)

source: Medium Quality (85%)
tr_tr: Orta Kalite (85%)

source: JPEG compression quality for uploaded images
tr_tr: Yüklenen resimler için JPEG sıkıştırma kalitesi

source: Image Optimization
tr_tr: Resim Optimizasyonu

source: Optimize images during upload (reduces file size)
tr_tr: Yükleme sırasında resimleri optimize et (dosya boyutunu azaltır)

source: Security check failed
tr_tr: Güvenlik kontrolü başarısız

source: You do not have sufficient permissions
tr_tr: Yeterli izniniz yok

source: You do not have permission to upload files
tr_tr: Dosya yükleme izniniz yok

source: You do not have permission to perform this action.
tr_tr: Bu işlemi gerçekleştirme yetkiniz yok.

source: %d orphaned media files were cleaned up.
tr_tr: %d sahipsiz medya dosyası temizlendi.

source: Chapter number and manga series are required.
tr_tr: Bölüm numarası ve manga serisi gereklidir.

source: Chapter %s already exists for this manga series.
tr_tr: Bu manga serisi için %s bölümü zaten mevcut.

source: File %s is too large. Maximum size: %s
tr_tr: %s dosyası çok büyük. Maksimum boyut: %s

source: File type %s is not allowed.
tr_tr: %s dosya türüne izin verilmiyor.

source: Error creating attachment:
tr_tr: Ek oluşturulurken hata:

source: Error uploading image:
tr_tr: Resim yüklenirken hata:

source: Unknown error
tr_tr: Bilinmeyen hata

source: File upload error (PHP Code: %s)
tr_tr: Dosya yükleme hatası (PHP Kodu: %s)

source: %s Chapter %s
tr_tr: %s Bölüm %s

source: Error creating chapter post:
tr_tr: Bölüm gönderisi oluşturulurken hata:

source: Chapter uploaded successfully!
tr_tr: Bölüm başarıyla yüklendi!

source: Manga series is required.
tr_tr: Manga serisi gereklidir.

source: ZIP extension is not enabled on the server. Please contact your hosting provider.
tr_tr: ZIP uzantısı sunucuda etkin değil. Lütfen hosting sağlayıcınızla iletişime geçin.

source: ZIP file upload error (PHP Code: %s)
tr_tr: ZIP dosyası yükleme hatası (PHP Kodu: %s)

source: ZIP file is too large. Maximum size: %s
tr_tr: ZIP dosyası çok büyük. Maksimum boyut: %s

source: Could not move ZIP file to temporary directory. Check file permissions.
tr_tr: ZIP dosyası geçici dizine taşınamadı. Dosya izinlerini kontrol edin.

source: Could not open ZIP file. Error code:
tr_tr: ZIP dosyası açılamadı. Hata kodu:

source: (Not a valid ZIP archive)
tr_tr: (Geçerli bir ZIP arşivi değil)

source: Could not create temporary extraction directory.
tr_tr: Geçici çıkarma dizini oluşturulamadı.

source: Could not extract ZIP contents.
tr_tr: ZIP içeriği çıkarılamadı.

source: Invalid chapter folder name: %s. Must start with a number.
tr_tr: Geçersiz bölüm klasör adı: %s. Sayı ile başlamalıdır.

source: Chapter %s already exists, skipping.
tr_tr: %s bölümü zaten mevcut, atlanıyor.

source: Image %s is too large, skipping chapter.
tr_tr: %s resmi çok büyük, bölüm atlanıyor.

source: Could not add image to media library: %s - %s
tr_tr: Resim medya kütüphanesine eklenemedi: %s - %s

source: Error creating image attachment: %s - %s
tr_tr: Resim eki oluşturulurken hata: %s - %s

source: No images found in folder: %s
tr_tr: Klasörde resim bulunamadı: %s

source: Error creating chapter post: %s
tr_tr: Bölüm gönderisi oluşturulurken hata: %s

source: Chapter %s (%s) uploaded successfully.
tr_tr: %s (%s) bölümü başarıyla yüklendi.

source: Processing completed. %d chapters uploaded.
tr_tr: İşlem tamamlandı. %d bölüm yüklendi.

source: Blogger URL and manga series are required.
tr_tr: Blogger URL'si ve manga serisi gereklidir.

source: Invalid URL format.
tr_tr: Geçersiz URL formatı.

source: Could not access Blogger URL: %s
tr_tr: Blogger URL'sine erişilemedi: %s

source: HTTP Error: %s
tr_tr: HTTP Hatası: %s

source: Empty response from Blogger URL.
tr_tr: Blogger URL'sinden boş yanıt.

source: No images found on the page. The page might use JavaScript loading or have a different structure.
tr_tr: Sayfada resim bulunamadı. Sayfa JavaScript yüklemesi kullanıyor olabilir veya farklı bir yapıya sahip olabilir.

source: Could not download image: %s - %s
tr_tr: Resim indirilemedi: %s - %s

source: Image too large, skipping: %s
tr_tr: Resim çok büyük, atlanıyor: %s

source: No images could be downloaded successfully. Found %d images but all failed.
tr_tr: Hiçbir resim başarıyla indirilemedi. %d resim bulundu ama hepsi başarısız.

source: Chapter fetched successfully with %d images! (Failed: %d)
tr_tr: Bölüm %d resimle başarıyla çekildi! (Başarısız: %d)
